<a href="https://colab.research.google.com/github/dougscohen/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/module3-join-and-reshape-data/LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [5]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-02-12 22:50:09--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.1.94
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.1.94|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  96.2MB/s    in 2.0s

2020-02-12 22:50:12 (96.2 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [6]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [7]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [8]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

1. I will need to get the 'product_name' and the 'add_to_order' columns
   
   a) the 'product_name' comes from 'products'
   
   b) the 'add_to_order' comes from the 'order_products_prior' and 'order_products_train' datasets

In [9]:
# Read in each .csv file to see which dataframes we will need

import pandas as pd

aisles = pd.read_csv('aisles.csv')

aisles.head()

# We don't need this dataframe

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [10]:
departments = pd.read_csv('departments.csv')

departments.head()

# We don't need this dataframe

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [11]:
order_products_prior = pd.read_csv('order_products__prior.csv')

order_products_prior.head()

# I believe we need 'add_to_cart_order' and 'reordered' from this dataframe

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [12]:
order_products_train = pd.read_csv('order_products__train.csv')

order_products_train.head()

# I believe we need 'add_to_cart_order' and 'reordered' from this dataframe

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [13]:
orders = pd.read_csv('orders.csv')

orders.head()

# We don't need anything from this dataframe

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [14]:
products = pd.read_csv('products.csv')

products.head()

# We need 'product_name' from this dataframe

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [15]:
# First we will concatonate the 'order_products_prior' dataframe and the 
# order_products_train' dataframe

order_products = pd.concat([order_products_prior, order_products_train])

print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [16]:
# Filter out the columns that we don't need in "products" dataframe

products_subset = products.drop(['aisle_id', 'department_id'], axis=1)

products_subset.head()

   product_id                                       product_name
0           1                         Chocolate Sandwich Cookies
1           2                                   All-Seasons Salt
2           3               Robust Golden Unsweetened Oolong Tea
3           4  Smart Ones Classic Favorites Mini Rigatoni Wit...
4           5                          Green Chile Anytime Sauce

In [77]:
# Merge the two dataframes together using .merge() on the 'product_id' column

merged = pd.merge(order_products, products_subset, on='product_id', how='inner')

print(merged.shape)
merged.head()

(465336, 7)

   order_id  product_id  ...  aisle_id  department_id
0         5       13176  ...        24              4
1        27       13176  ...        24              4
2        29       13176  ...        24              4
3        32       13176  ...        24              4
4        42       13176  ...        24              4

[5 rows x 7 columns]

In [18]:
# Use 'value_counts' to how many times each product was ordered

# having a bit of trouble understanding the 'add_to_cart_order' 
# for instance, in row 3, does it mean 13 organic egg whites were added to the cart

merged['product_name'].value_counts().head(10)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [19]:
# Hey James, silly me replicated the entire lesson code indtead of the just 
# 'reshpaing data' section. So you can ignore a good chunk of this. It was 
# still good practice but now I see what it took me so long

# We can contatenate two strings together using the '+' operator.

'We can join/concatenate two strings together ' + 'using the "+" operator.'

'We can join/concatenate two strings together using the "+" operator.'

In [0]:
df1 = pd.DataFrame({'a': [1,2,3,4], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df2 = pd.DataFrame({'a': [6,4,8,7], 'b': [9,4,3,2], 'c': [1,6,2,9]})

In [21]:
df1.head()

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10

In [22]:
df2.head()

   a  b  c
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9

In [23]:
# Concatenation by rows is the default functionality of pd.concat

concat_by_rows = pd.concat([df1, df2])

concat_by_rows

   a  b   c
0  1  4   7
1  2  5   8
2  3  6   9
3  4  7  10
0  6  9   1
1  4  4   6
2  8  3   2
3  7  2   9

In [24]:
concat_by_columns = pd.concat([df1, df2], axis=1)

concat_by_columns

   a  b   c  a  b  c
0  1  4   7  6  9  1
1  2  5   8  4  4  6
2  3  6   9  8  3  2
3  4  7  10  7  2  9

In [0]:
# Sometimes we will concatenate dataframes and the row index values or columns 
# don't match up. If that's the case, then NaN values will be added where 
# matches aren't found

df3 = pd.DataFrame({'a': [4,3,2,1], 'b': [4,5,6,7], 'c': [7,8,9,10]})

df4 = pd.DataFrame({'a': [6,4,8,7,8], 'b': [9,4,3,2,1], 'd': [1,6,2,9,5]})

In [26]:
df3.head()

   a  b   c
0  4  4   7
1  3  5   8
2  2  6   9
3  1  7  10

In [27]:
df4.head()

   a  b  d
0  6  9  1
1  4  4  6
2  8  3  2
3  7  2  9
4  8  1  5

In [28]:
# Concatenting by rows when all column headers do not match

pd.concat([df3, df4])

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

   a  b     c    d
0  4  4   7.0  NaN
1  3  5   8.0  NaN
2  2  6   9.0  NaN
3  1  7  10.0  NaN
0  6  9   NaN  1.0
1  4  4   NaN  6.0
2  8  3   NaN  2.0
3  7  2   NaN  9.0
4  8  1   NaN  5.0

In [29]:
# Concatenating by columns when all row indexes don't match

pd.concat([df3, df4], axis=1)

     a    b     c  a  b  d
0  4.0  4.0   7.0  6  9  1
1  3.0  5.0   8.0  4  4  6
2  2.0  6.0   9.0  8  3  2
3  1.0  7.0  10.0  7  2  9
4  NaN  NaN   NaN  8  1  5

In [30]:
# Our goal is to reproduce this table which holds the first two orders for 
# user ID 1

from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [31]:
# Everything is already loaded in, so I will skip the below commands. This is 
# what was used to call in the file, unzip it, and change the starting place 
#of the folder to make it easier

''' !wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

%cd instacart_2017_05_01

!ls -lh *.csv'''

# I will redo loading each file into the notebook, as I have already done it above

aisles = pd.read_csv('aisles.csv')

print(aisles.shape)
aisles.head()

# We don't need anything from this table

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [32]:
# we don't need anything from this table 

departments = pd.read_csv('departments.csv')

print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [33]:
# From this table we need 'order_id', 'product_id', and 'add_to_cart_order'

order_products_prior = pd.read_csv('order_products__prior.csv')

print(order_products_prior.shape)
order_products_prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [34]:
# From this table we need 'order_id', 'product_id', and 'add_to_cart_order'

order_products_train = pd.read_csv('order_products__train.csv')

print(order_products_train.shape)
order_products_train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [35]:
# From this table we need 'order_id', 'user_id', 'order_number', 'order_dow', 
# 'order_hour_of_day'

orders = pd.read_csv('orders.csv')

print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [36]:
# From this table we need 'product_id', 'product_name'

products = pd.read_csv('products.csv')

print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [37]:
# Always pay attention to 'id' columbns because it is from those columns 
# that we will match data into a single table

# Let's look at our image again

display(example)

In [38]:
# Concatentate "order_products_prior" and "order_products_train"

# Double underscores in a file name typically tell us that this is not how 
# the data was originally stored

order_products_prior.shape

(32434489, 4)

In [39]:
order_products_train.shape

(1384617, 4)

In [40]:
orders_products = pd.concat([order_products_prior, order_products_train])

print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [41]:
display(example)

In [42]:
# We need to identify which dataframes we would like to combine
# We need to find columns that are common between both dataframes that we can 
# use to matchup information
# We need to slim down our dataframes so that they only have relevant data 
# before we merge
# Then we need to merge the dataframes

# First let's combine "orders" and "orders_products". We will need to slim 
# down the dataframes to concatin only the information we need

# The specific conditions we could use to slim down our "orders" dataframe is 
# 'user_id' == 1 and order_id <=2
# OR 
# 'order_id' == 2539329 or 'order_id' == 2398795

condition = (orders['user_id'] == 1) & (orders['order_number'] <=2)

orders_subset = orders[condition]

print(orders_subset.shape)
orders_subset.head()

(2, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0

[2 rows x 7 columns]

In [43]:
condition2 = (order_products['order_id'] == 2539329) | (orders_products['order_id'] == 2398795)

order_products_subset = order_products[condition2]

print(order_products_subset.shape)
order_products_subset.head(11)

(11, 4)

          order_id  product_id  add_to_cart_order  reordered
22742744   2398795         196                  1          1
22742745   2398795       10258                  2          0
22742746   2398795       12427                  3          1
22742747   2398795       13176                  4          0
22742748   2398795       26088                  5          1
22742749   2398795       13032                  6          0
24076664   2539329         196                  1          0
24076665   2539329       14084                  2          0
24076666   2539329       12427                  3          0
24076667   2539329       26088                  4          0
24076668   2539329       26405                  5          0

In [44]:
display(example)

In [45]:
# Now we can merge these two tables together

orders_and_products = pd.merge(orders_subset, order_products_subset, on='order_id', how='inner')

orders_and_products

    order_id  user_id eval_set  ...  product_id  add_to_cart_order  reordered
0    2539329        1    prior  ...         196                  1          0
1    2539329        1    prior  ...       14084                  2          0
2    2539329        1    prior  ...       12427                  3          0
3    2539329        1    prior  ...       26088                  4          0
4    2539329        1    prior  ...       26405                  5          0
5    2398795        1    prior  ...         196                  1          1
6    2398795        1    prior  ...       10258                  2          0
7    2398795        1    prior  ...       12427                  3          1
8    2398795        1    prior  ...       13176                  4          0
9    2398795        1    prior  ...       26088                  5          1
10   2398795        1    prior  ...       13032                  6          0

[11 rows x 10 columns]

In [46]:
# Remove columns we don't need

orders_and_products = orders_and_products.drop(['eval_set', 'reordered', 'days_since_prior_order'], axis=1)

orders_and_products.head(11)

    order_id  user_id  ...  product_id  add_to_cart_order
0    2539329        1  ...         196                  1
1    2539329        1  ...       14084                  2
2    2539329        1  ...       12427                  3
3    2539329        1  ...       26088                  4
4    2539329        1  ...       26405                  5
5    2398795        1  ...         196                  1
6    2398795        1  ...       10258                  2
7    2398795        1  ...       12427                  3
8    2398795        1  ...       13176                  4
9    2398795        1  ...       26088                  5
10   2398795        1  ...       13032                  6

[11 rows x 7 columns]

In [47]:
# Now we need to merge "orders_and_products" with "products"

# First lets slim down the "products" dataframe

condition3 = products['product_id'].isin(orders_and_products['product_id'])

products_subset = products[condition3]

products_subset

       product_id  ... department_id
195           196  ...             7
10257       10258  ...            19
12426       12427  ...            19
13031       13032  ...            14
13175       13176  ...             4
14083       14084  ...            16
26087       26088  ...            19
26404       26405  ...            17

[8 rows x 4 columns]

In [48]:
final = pd.merge(orders_and_products, products_subset, on='product_id', how='inner')

final

    order_id  user_id  ...  aisle_id  department_id
0    2539329        1  ...        77              7
1    2398795        1  ...        77              7
2    2539329        1  ...        91             16
3    2539329        1  ...        23             19
4    2398795        1  ...        23             19
5    2539329        1  ...        23             19
6    2398795        1  ...        23             19
7    2539329        1  ...        54             17
8    2398795        1  ...       117             19
9    2398795        1  ...        24              4
10   2398795        1  ...       121             14

[11 rows x 10 columns]

In [49]:
# Clean the table to make it like picture

final = final.drop(['aisle_id', 'department_id'], axis=1)

final

    order_id  ...                             product_name
0    2539329  ...                                     Soda
1    2398795  ...                                     Soda
2    2539329  ...  Organic Unsweetened Vanilla Almond Milk
3    2539329  ...                      Original Beef Jerky
4    2398795  ...                      Original Beef Jerky
5    2539329  ...               Aged White Cheddar Popcorn
6    2398795  ...               Aged White Cheddar Popcorn
7    2539329  ...         XL Pick-A-Size Paper Towel Rolls
8    2398795  ...                               Pistachios
9    2398795  ...                   Bag of Organic Bananas
10   2398795  ...                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [50]:
display(example)

In [51]:
# sort rows

final = final.sort_values(by=['order_number', 'add_to_cart_order'])

final

    order_id  ...                             product_name
0    2539329  ...                                     Soda
2    2539329  ...  Organic Unsweetened Vanilla Almond Milk
3    2539329  ...                      Original Beef Jerky
5    2539329  ...               Aged White Cheddar Popcorn
7    2539329  ...         XL Pick-A-Size Paper Towel Rolls
1    2398795  ...                                     Soda
8    2398795  ...                               Pistachios
4    2398795  ...                      Original Beef Jerky
9    2398795  ...                   Bag of Organic Bananas
6    2398795  ...               Aged White Cheddar Popcorn
10   2398795  ...                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [52]:
# reorder columns

final = final[['user_id', 'order_id', 'order_number', 'order_dow', 'order_hour_of_day', 'add_to_cart_order', 'product_id', 'product_name']]

final

    user_id  order_id  ...  product_id                             product_name
0         1   2539329  ...         196                                     Soda
2         1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
3         1   2539329  ...       12427                      Original Beef Jerky
5         1   2539329  ...       26088               Aged White Cheddar Popcorn
7         1   2539329  ...       26405         XL Pick-A-Size Paper Towel Rolls
1         1   2398795  ...         196                                     Soda
8         1   2398795  ...       10258                               Pistachios
4         1   2398795  ...       12427                      Original Beef Jerky
9         1   2398795  ...       13176                   Bag of Organic Bananas
6         1   2398795  ...       26088               Aged White Cheddar Popcorn
10        1   2398795  ...       13032                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [53]:
# remove underscores from column headers

final.columns = [column.replace('_', ' ') for column in final]

final

    user id  order id  ...  product id                             product name
0         1   2539329  ...         196                                     Soda
2         1   2539329  ...       14084  Organic Unsweetened Vanilla Almond Milk
3         1   2539329  ...       12427                      Original Beef Jerky
5         1   2539329  ...       26088               Aged White Cheddar Popcorn
7         1   2539329  ...       26405         XL Pick-A-Size Paper Towel Rolls
1         1   2398795  ...         196                                     Soda
8         1   2398795  ...       10258                               Pistachios
4         1   2398795  ...       12427                      Original Beef Jerky
9         1   2398795  ...       13176                   Bag of Organic Bananas
6         1   2398795  ...       26088               Aged White Cheddar Popcorn
10        1   2398795  ...       13032                    Cinnamon Toast Crunch

[11 rows x 8 columns]

In [54]:
display(example)

In [0]:
# Learn Tidy Data

%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

In [56]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [57]:
# we can use the .melt() function to reshape Table 1 into tidy format

# Take the row inde, and add it as a new column

table1 = table1.reset_index()

table1

          index  treatmenta  treatmentb
0    John Smith         NaN           2
1      Jane Doe        16.0          11
2  Mary Johnson         3.0           1

In [58]:
# what is the unique identifier for each row 
# Where is the data at that I want to be in my single 'tidy' column?

tidy1 = table1.melt(id_vars='index', value_vars=['treatmenta', 'treatmentb'])

tidy1

          index    variable  value
0    John Smith  treatmenta    NaN
1      Jane Doe  treatmenta   16.0
2  Mary Johnson  treatmenta    3.0
3    John Smith  treatmentb    2.0
4      Jane Doe  treatmentb   11.0
5  Mary Johnson  treatmentb    1.0

In [59]:
# rename columns

tidy1 = tidy1.rename(columns={
    'index': 'name',
    'variable': 'trt',
    'value': 'result'
})

tidy1

           name         trt  result
0    John Smith  treatmenta     NaN
1      Jane Doe  treatmenta    16.0
2  Mary Johnson  treatmenta     3.0
3    John Smith  treatmentb     2.0
4      Jane Doe  treatmentb    11.0
5  Mary Johnson  treatmentb     1.0

In [60]:
tidy1.trt = tidy1.trt.str.replace('treatment', '')

tidy1

           name trt  result
0    John Smith   a     NaN
1      Jane Doe   a    16.0
2  Mary Johnson   a     3.0
3    John Smith   b     2.0
4      Jane Doe   b    11.0
5  Mary Johnson   b     1.0

In [61]:
# The pivot_table function is the reverse of melt

# index = unique identifier
# columns = What do you want to differentiate the columns in wide format
# values = Where are the numbers at - go in the middle of the wide dataframe

wide = tidy1.pivot_table(index='name', columns='trt', values='result')

wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [108]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [110]:
# First we need to reset the index of table2

table2 = table2.reset_index()

table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [112]:
# table2 -> tidy

tidy = table2.melt(id_vars='index', value_vars=['John Smith', 'Jane Doe', 'Mary Johnson'])

tidy

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [113]:
# tidy -> table2

table2 = tidy.pivot_table(values='value', index='index', columns='variable')

table2

# Why does it put Jane Doe first??

variable    Jane Doe  John Smith  Mary Johnson
index
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

In [0]:
flights = sns.load_dataset('flights')

In [117]:
# let's see what the "flights" table looks like

flights

# looks to be tidy data

     year      month  passengers
0    1949    January         112
1    1949   February         118
2    1949      March         132
3    1949      April         129
4    1949        May         121
..    ...        ...         ...
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

[144 rows x 3 columns]

In [116]:
# Flights Pivot Table

# use the .pivot_table() function on the flights table to make a wide
# version of it

wide_flights = flights.pivot_table(values='passengers', index='year', columns='month')

wide_flights

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####